package test_task.generate;

import java.time.LocalDate;
import java.util.Random;

public final class EmployeeGenerator {
    private EmployeeGenerator(){}
    private static final String[] femaleFamilyName = {"Артанова", "Артеева", "Артеменкова", "Богодухова", "Богоевленская", "Боголепова", "Варухина", "Варнакова", "Валиева",
            "Ганина", "Ганкина", "Гапеева", "Дедова", "Дариева", "Дедушкина", "Евтюнина", "Евтюничева", "Евтютина", "Жарина", "Жегалина", "Железнова",
            "Заева", "Заморова", "Забелина", "Ибрагимова", "Ивахина", "Ивкина", "Колюбакина", "Колюхина", "Колягина", "Ларина", "Лапина", "Лазарева",
            "Мокроусова", "Майданова", "Майорова", "Назарова", "Наумова", "Нарокова", "Оборина", "Ободина", "Обичкина", "Павлова", "Петрова", "Палкина",
            "Рабина", "Ракова", "Раскина", "Савина", "Сакова", "Салинова", "Табакова", "Тарабаева", "Таранова", "Угарова", "Узлова", "Умнова",
            "Фадеева", "Федорова", "Федосеева", "Харчева", "Ханаева", "Халявина", "Цветкова", "Царева", "Цыганкина", "Чавкина", "Чеканова", "Чеглова",
            "Шабалина", "Шавина", "Шаврина", "Щербакова", "Щурина", "Щукина", "Эрекаева", "Эктова", "Элишаева", "Югова", "Юрцева", "Юрина", "Язева",
            "Янина", "Яхнова"};
    private static final String[] maleFamilyName = {"Артанов", "Артеев", "Артеменков", "Богодухов", "Богоевленский", "Боголепов", "Варухин", "Варнаков", "Валиев",
            "Ганин", "Ганкин", "Гапеев", "Дедов", "Дариев", "Дедушкин", "Евтюнин", "Евтюничев", "Евтютин", "Жарин", "Жегалин", "Железнов",
            "Заев", "Заморов", "Забелин", "Ибрагимов", "Ивахин", "Ивкин", "Колюбакин", "Колюхин", "Колягин", "Ларин", "Лапин", "Лазарев",
            "Мокроусов", "Майданов", "Майоров", "Назаров", "Наумов", "Нароков", "Оборин", "Ободин", "Обичкин", "Павлов", "Петров", "Палкин",
            "Рабин", "Раков", "Раскин", "Савин", "Саков", "Салинов", "Табаков", "Тарабаев", "Таранов", "Угаров", "Узлов", "Умнов",
            "Фадеев", "Федоров", "Федосеев", "Харчев", "Ханаев", "Халявин", "Цветков", "Царев", "Цыганкин", "Чавкин", "Чеканов", "Чеглов",
            "Шабалин", "Шавин", "Шаврин", "Щербаков", "Щурин", "Щукин", "Эрекаев", "Эктов", "Элишаев", "Югов", "Юрцев", "Юрин", "Язев",
            "Янин", "Яхнов"};
    private static final String[] femaleLastName = {"Алексеевна", "Анатольевна", "Александровна", "Борисовна", "Борисова", "Богданова", "Владимировна", "Владиславовна", "Вячеславовна",
            "Георгьева", "Григорьевна", "Геннадьевна", "Денисовна", "Давидовна", "Демидова", "Евгеньевна", "Егоровна", "Ефимовна", "Жановна", "Жоресовна",
            "Жардемовна", "Захаровна", "Захарьевна", "Зиновьевна", "Ивановна", "Игнатовна", "Ильична", "Климовна", "Константиновна", "Каллиниковна",
            "Леонтьевна", "Леонидовна", "Львовна", "Максимовна", "Митрофановна", "Михайловна", "Николаевна", "Никифоровна", "Николаевна", "Олеговна", "Осиповна",
            "Орынгалеевна", "Павлова", "Петровна", "Платоновна", "Романовна", "Ростиславовна", "Руслановна", "Степановна", "Сергеевна", "Серафимовна", "Тимофеевна",
            "Тимуровна", "Тихоновна", "Убайдовна", "Убайдуллаевна", "Уаровна", "Фёдоровна", "Филипповна", "Федотовна", "Харитоновна", "Харламовна", "Харламповна",
            "Юрьевна", "Юраевна", "Юзаевна"};
    private static final String[] maleLastName = {"Алексеевич", "Анатольевич", "Александрович", "Борисович", "Борисович", "Богданович", "Владимирович", "Владиславович", "Вячеславович",
            "Георгьевич", "Григорьевич", "Геннадьевич", "Денисович", "Давидович", "Демидович", "Евгеньевич", "Егорович", "Ефимович", "Жанович", "Жоресович",
            "Жардемович", "Захарович", "Захарьевич", "Зиновьевич", "Иванович", "Игнатович", "Ильич", "Климович", "Константинович", "Каллиникович",
            "Леонтьевич", "Леонидович", "Львович", "Максимович", "Митрофанович", "Михайлович", "Николаевич", "Никифорович", "Николаевич", "Олегович", "Осипович",
            "Орынгалеевич", "Павлович", "Петрович", "Платонович", "Романович", "Ростиславович", "Русланович", "Степанович", "Сергеевич", "Серафимович", "Тимофеевич",
            "Тимурович", "Тихонович", "Убайдович", "Убайдуллаевич", "Уарович", "Фёдорович", "Филиппович", "Федотович", "Харитонович", "Харламович", "Харлампович",
            "Юрьевич", "Юраевич", "Юзаевич"};
    private static final String[] femaleFirstName = { "Августа", "Августина", "Авдотья", "Белла", "Бажена", "Богдана", "Вера", "Варвара", "Василиса",
            "Галина", "Галла", "Галя", "Дарья", "Динара", "Диана", "Ева", "Евгения", "Елена", "Жанна", "Жизель", "Жозефина", "Зинаида", "Зоя",
            "Зухра", "Инга", "Инна", "Ирина", "Карина", "Клавдия", "Ксения", "Лолита", "Любовь", "Людмила", "Марина", "Маргарита", "Мая", "Наина",
            "Нана", "Наркисса", "Оксана", "Олеся", "Ольга", "Патриция", "Паула", "Полина", "Регина", "Роза", "Раиса", "Степанида", "Стефанида", "Стефания",
            "Тамара", "Тарасия", "Татьяна", "Ульяна", "Урсула", "Ундина", "Фаина", "Фатима", "Фрида", "Харита", "Хельга", "Халима", "Цецелия", "Цецилия",
            "Цирцея", "Шаадия", "Шарифа", "Шарлотта", "Элиза", "Эмма", "Эдита", "Юлиания", "Юлия", "Юна", "Ядвига", "Яна", "Ярослава"};
    private static final String[] maleFirstName = {"Анатолий", "Аркадий", "Артур", "Богдан", "Борис", "Бернард", "Владимир", "Владислав", "Владлен", "Геннадий",
            "Глеб", "Григорий", "Давид", "Дамир", "Денис", "Егор", "Ефим", "Евсей", "Жак", "Жан", "Жозеф", "Захар", "Захир", "Зигфрид", "Иван", "Игорь",
            "Илья", "Кирилл", "Кузьма", "Константин", "Леонид", "Леонтий", "Лев", "Марк", "Михаил", "Матвей", "Никита", "Николай", "Назим", "Олег", "Остап",
            "Оскар", "Павел", "Пётр", "Прохор", "Радислав", "Рустам", "Роман", "Станислав", "Степан", "Семён", "Тимур", "Тимофей", "Тарас",
            "Устин", "Усама", "Уврикий", "Федот", "Фёдор", "Филипп", "Хабиб", "Харитон", "Хасан", "Цезарь", "Цекул", "Цетон", "Часлав", "Чеслав", "Чингиз",
            "Шамиль", "Шариф", "Шамаш", "Эдуард", "Эдвард", "Эмиль", "Юрий", "Юсуф", "Юлиан", "Яков", "Ярослав", "Ян"};
    public static String randSex() {
        return new Random().nextInt(2) == 1 ? "Male" : "Female";
    }
    public static String randName(String sex) {
        String name;
        if(sex.equals("Female"))
            name = femaleFirstName[new Random().nextInt(femaleFirstName.length - 1)];
        else
            name = maleFirstName[new Random().nextInt(maleFirstName.length - 1)];
        return name;
    }
    public static String randFamilyName(String sex) {
        String familyName;
        if(sex.equals("Female"))
            familyName = femaleFamilyName[new Random().nextInt(femaleFamilyName.length - 1)];
        else
            familyName = maleFamilyName[new Random().nextInt(maleFamilyName.length - 1)];
        return familyName;
    }
    public static String randLastName(String sex) {
        String lastName;
        if(sex.equals("Female"))
            lastName = femaleLastName[new Random().nextInt(femaleLastName.length - 1)];
        else
            lastName = maleLastName[new Random().nextInt(maleLastName.length - 1)];
        return lastName;
    }
    public static String randMaleFamilyNameStartsWithF(){
        String[] maleLastNameStartsWithF = {"Фадеев", "Федоров", "Федосеев", "Федосов", "Федотов", "Фетисов", "Федисов", "Филиппов", "Федосян", "Фарук"};
        return maleLastNameStartsWithF[new Random().nextInt(maleLastNameStartsWithF.length - 1)];
    }
    public static String randDate(){
       return LocalDate.now().
               minusYears(new Random().nextInt(52) + 18).
               minusMonths(new Random().nextInt(12)).
               minusDays(new Random().nextInt(31)).toString();
    }
}
